import pandas as pd
import pytest

from src.reports import spending_by_category


@pytest.fixture()
def test_list():
    return [{'Дата операции': '03.12.2023 19:00:00',
             'Номер карты': "*6359",
             'Статус': 'OK',
             'Сумма операции': -1350.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 0,
             'Категория': 'Супермаркет',
             'Описание': 'Магнит'
             },
            {'Дата операции': '25.10.2023 12:25:05',
             'Номер карты': "*6780",
             'Статус': 'OK',
             'Сумма операции': -2299.99,
             'Валюта операции': "RUB",
             'Кэшбэк': 5.0,
             'Категория': 'Кафе',
             'Описание': 'Такси'
             },
            {'Дата операции': '05.12.2023 19:09:02',
             'Номер карты': "*1212",
             'Статус': 'FAILED',
             'Сумма операции': -1999.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 0,
             'Категория': 'Госуслуги',
             'Описание': 'Штраф'
             },
            {'Дата операции': '23.09.2023 23:23:00',
             'Номер карты': "Nan",
             'Статус': 'OK',
             'Сумма операции': -10800.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 15.0,
             'Категория': 'Супермаркет',
             'Описание': 'Пятерочка'
             }
            ]


def test_spending_by_category(test_list):
    df_1 = pd.DataFrame(test_list)
    results = spending_by_category(df_1, "Супермаркет", "07.12.2023").to_dict(orient="records")
    assert [item["Категория"] for item in results] == ["Супермаркет"]
